<template>
    <div class="cards-page-container">
        <v-simple-card>
            <h2>Преамбула</h2>

            <p>Настоящее Пользовательское Соглашение (далее – «Соглашение») является официальной письменной публичной
                офертой Разработчика, адресованной неопределенному кругу лиц – Пользователям веб-приложения PlaShiki и
                сопутствующих проектов (далее вместе «Стороны», по отдельности «Сторона»).</p>
            <p>Использование веб-приложения PlaShiki и сопутствующих проектов допускается лишь на условиях данного
                Соглашения.</p>
            <p>Если Пользователь не принимает Соглашение в полном объеме, Пользователь не имеет права использовать
                веб-приложения PlaShiki и сопутствующих проектов в любых целях, а также он обязан прекратить использование
                веб-приложения PlaShiki и сопутствующих проектов.</p>
            <p>Использование веб-приложения PlaShiki и сопутствующих проектов с нарушением (невыполнением) какого-либо из
                условий Соглашения запрещено.</p>

            <p>Термины, используемые в настоящем Соглашении:</p>
            <p>Разработчик – физическое или юридическое лицо, разработавшее веб-приложение PlaShiki и/или сопутствующие
                проекты, разместившее его на Сайте, и предоставляющее его в бесплатное пользование Пользователю на условиях
                данного Соглашения.</p>
            <p>Пользователь – юридическое или физическое лицо, осуществившее акцепт Соглашения в соответствии с его
                условиями в целях использования Приложения.</p>
            <p>Устройство – персональный компьютер (в том числе, но не исключительно стационарный компьютер, ноутбук,
                нетбук, десктоп), смартфон, планшетный компьютер или серверное оборудование Пользователя.</p>
            <p>Веб-приложение PlaShiki, Приложение, PlaShiki – программное обеспечение, которое доступно в режиме он-лайн
                или устанавливается на Устройство Пользователя и дополняет Устройство соответствующей функцией, которая
                предоставляется по данному Соглашению Пользователю и является собственностью Разработчика, предназначенная
                для выполнения определенных пользовательских задач (в том числе, но не исключительно), скачивания и
                просмотра медиа файлов с других сайтов и рассчитана на непосредственное взаимодействие с Пользователем на
                его Устройстве.</p>
            <p>Сайт – сайт, расположенный в сети Интернет по адресу https://plashiki.su, или другой домен, находящийся в
                собственности Разработчика, на котором находится веб-приложение PlaShiki и сопутствующие проекты, которое
                Пользователь может использовать в режиме он-лайн или установить себе на Устройство.</p>
            <p>Активное Действие Пользователя – это результат поведения Пользователя с использованием веб-приложения
                PlaShiki или сопутствующих проектов на своем Устройстве, включая, но не исключительно, скачивание и просмотр
                медиа файлов с других сайтов.</p>

            <p>В Соглашении могут быть использованы термины, не определенные в настоящем разделе Соглашения. В этом случае
                толкование такого термина производится в соответствии с текстом Соглашения. В случае отсутствия однозначного
                толкования термина в тексте Соглашения следует руководствоваться толкованием термина: в первую очередь –
                определенным на Сайте, во вторую очередь – сложившимся в сети Интернет.</p>


            <p>1. Акцепт Соглашения</p>

            <p>1.1. Данное Соглашение вступает в силу с «21» мая 2020 года.</p>
            <p>1.2. Для существующих Пользователей/Пользователей, которые использовали Приложение, настоящее Соглашение
                вступает в силу с момента Активного Действия Пользователя.</p>
            <p>1.3. Для новых Пользователей/Пользователей, которые еще не использовали Приложение, настоящее Соглашение
                вступает в силу с момента запуска Приложения на своем Устройстве.</p>
            <p>1.4. Данное Соглашение действует в течение всего периода эксплуатации Приложения Пользователем.</p>
            <p>1.5. Акцепт условий Соглашения равносилен заключению двухстороннего письменного Пользовательского Соглашения
                Разработчика.</p>


            <p>2. Права и обязанности Сторон</p>

            <p>2.1. Пользователь:</p>

            <p>2.1.1. обязан ознакомиться с информацией о Разработчике, условиями конфиденциальности Разработчика и
                настоящим Соглашением перед использованием Приложения.</p>
            <p>2.1.2. обязан использовать Приложение только в личных некоммерческих целях.</p>
            <p>2.1.3. имеет право вносить свои изменения в работу Приложения, при условии последующего раскрытия исходного
                кода в рамках лицензии GPLv3.</p>
            <p>2.1.4. не имеет право предлагать услуги, связанные с использованием Приложения другим Пользователям в целях
                извлечения прибыли.</p>
            <p>2.1.5. не имеет право совершать действия, направленные на нарушение нормального функционирования Приложения,
                и использовать специальные программы, содержащие вредоносные компоненты («вирусы»).</p>
            <p>2.1.6. не имеет права распространять медиа файлы, которые были скачаны/просмотрены с помощью Приложения.</p>
            <p>2.1.7. обязан прекратить использование (в том числе процесс установки) Приложения и удалить его со своего
                Устройства, если Пользователь не принимает Соглашение в полном объеме.</p>
            <p>2.1.8. несет личную ответственность за несанкционированное использование медиа файлов правообладателя, а
                именно скачивание/просмотр медиа файлов, нарушающих законодательство об авторском праве.</p>
            <p>2.1.9. имеет право распространять любыми способами Приложение.</p>
            <p>2.1.10. осуществляет вышеуказанные действия на свой риск.</p>


            <p>2.2. Разработчик:</p>

            <p>2.2.1. вправе в любое время вносить изменения в функционал Приложения, интерфейс и/или содержание Приложения
                с уведомлением Пользователей или без уведомления.</p>
            <p>2.2.2. обязан предоставить простой способ связи для обращений Пользователей по всем возникающим вопросам в
                процессе использования Приложения.</p>
            <p>2.2.3. имеет право блокировать/удалять медиа файлы, нарушающие законодательство.</p>
            <p>2.2.4. имеет право, при использовании Пользователем Приложения, редактировать, удалять, хранить на Устройстве
                cookie файлы, а также редактировать, удалять и хранить медиа файлы, к которым Разработчик имеет техническую
                возможность доступа.</p>
            <p>2.2.5. не имеет никакого отношения к самому Приложению и последствиям установки/использования Приложения из
                любых других источников, кроме Сайта.</p>


            <p>3. Гарантии и Ответственность</p>

            <p>3.1. Пользователь признает и соглашается с тем, что Приложение предоставляется на условиях (“as is”) «как
                есть», без гарантий любого рода, как прямых, так и косвенных.</p>
            <p>3.2. Пользователь признает и соглашается с тем, что не имеет права получать доступ к медиа файлам, путем
                использования Приложения, без получения соответствующего разрешения правообладателя этих файлов, если такое
                ограничение правообладателям установлено. Наличие такого ограничения или его отсутствие обязан проверять
                Пользователь.</p>
            <p>3.3. Разработчик не предоставляет гарантий в отношении последствий использования Приложения, равно как и
                взаимодействия Приложения с другим программным обеспечением, включая, но не ограничиваясь внешними
                сервисами.</p>
            <p>3.4. Разработчик не предоставляет гарантий того, что Приложение может подходить для конкретных целей
                использования. Пользователь признает и соглашается с тем, что результат использования Приложения может не
                соответствовать ожиданиям Пользователя.</p>
            <p>3.5. Разработчик или иные правообладатели ни при каких обстоятельствах не несут ответственность за любой
                косвенный, случайный, неумышленный ущерб (включая упущенную выгоду, ущерб, причиненный утратой данных),
                вызванный в связи с использованием Приложения или невозможностью его использования, в том числе в случае
                отказа работы Приложения или иного перерыва в использовании Приложения, даже если Разработчик предупреждал
                или указывал на возможность такого ущерба.</p>
            <p>3.6. Пользователь самостоятельно несет ответственность за свои действия с использованием Приложения.</p>
            <p>3.7. Пользователь самостоятельно несет ответственность за соблюдение прав третьих лиц, применимого
                законодательства и настоящего Соглашения при использовании Приложения.</p>
            <p>3.8. За нарушения, допущенные Пользователем, Разработчик вправе отказать Пользователю в дальнейшем доступ к
                Приложению или ограничить доступ полностью или частично с уведомлением Пользователя или без уведомления.</p>


            <p>4. Ограничение ответственности</p>

            <p>4.1. Разработчик не отвечает за неисправности, ошибки и сбои в работе Приложения, возникшие по причинам, не
                зависящим от Разработчика.</p>
            <p>4.2. Разработчик не несет ответственности за причинённые неудобства Пользователю в результате использования
                или невозможности использования Приложения.</p>
            <p>4.3. Используя Приложение, Пользователь соглашается с тем, что скачивает, просматривает или прослушивает с
                его помощью любые медиа файлы на свой собственный риск и несет личную ответственность за возможные
                последствия использования указанных материалов, в том числе за ущерб, который это может причинить Устройству
                Пользователя или третьим лицам, за потерю данных, нарушение авторских прав или любой другой вред.</p>
            <p>4.4. Разработчик или его представители не несут ответственность перед Пользователем или перед любыми третьими
                лицами за любой косвенный, случайный, неумышленный ущерб, включая упущенную выгоду или потерянные данные,
                вред чести, достоинству или деловой репутации, вызванный в связи с использованием Приложения, или иных
                материалов, к которым Пользователь или иные лица получили доступ с помощью Приложения.</p>
            <p>4.5. Разработчик не имеет технической возможности отслеживать действия Пользователя (в том числе, но не
                исключительно) по просмотру медиа файлов с помощью Приложения.</p>
            <p>4.6. В обязанности Разработчика не входит контроль легальности или нелегальности передаваемой Пользователю
                информации (в том числе медиа файлов), определение прав собственности и законности передачи, приема или
                использования информации (в том числе медиа файлов).</p>
            <p>4.7. PlaShiki не является хранилищем файлов или FTP сервером, не содержит в себе оригинальные электронные
                версии получаемой Пользователями информации и/или материалов. PlaShiki осуществляет лишь переключение
                запросов между устройством Пользователя и серверным оборудованием того сайта, с которым взаимодействует
                Пользователь.</p>
            <p>4.8. Пользователь соглашается с тем, что при использовании Приложения можно получить доступ к информации (в
                том числе медиа файлам) неправомерно размещенной в Интернете. Разработчик не имеет возможности
                проконтролировать содержание и правомерность размещения информации (медиа файлов) на всех сайтах,
                следовательно, и не несет ответственность за:</p>
            <p>4.8.1. Содержание медиа файла, полученного Пользователем при помощи Приложения.</p>
            <p>4.8.2. Последствия применения, использования либо неиспользования Пользователем полученной информации (в том
                числе медиа файлов).</p>
            <p>4.8.3. Несоответствие результатов, полученных с помощью Приложения, ожиданиям Пользователя.</p>
            <p>4.8.4. Повреждения Устройства или программного обеспечения Пользователя, возникшие вследствие получения
                информации (в том числе медиа файлов) с помощью Приложения.</p>
            <p>4.8.5. Последствия, которые может повлечь распространение нелегальных либо нелицензированных медиа файлов, а
                также иных материалов либо данных, нарушающих право на интеллектуальную собственность третьих лиц.</p>
            <p>4.9. Стороны Соглашения освобождаются от ответственности за полное или частичное неисполнение своих
                обязательств по Соглашению, если таковое явилось следствием обстоятельств непреодолимой силы, возникших
                после вступления в силу Соглашения, в результате событий чрезвычайного характера, которые не могли быть
                предвидены и предотвращены разумными мерами.</p>


            <p>5. Персональная информация Пользователя и Условия Конфиденциальности</p>

            <p>5.1. Персональная информация Пользователя хранится и обрабатывается строго в Приложении или на серверном
                оборудовании Приложения, и не передается третьим лицам.</p>
            <p>5.2. Пользователь соглашается, что Разработчик имеет право предоставлять данную персональную информацию
                Партнерам с целью выполнения данного Соглашения.</p>
            <p>5.2. Приложение никаким образом не хранит пароли от учетных записей других сайтов или сервисов, которые могут
                потребоваться для авторизации в Приложении на этих сайтах или сервисах. В то же время, Приложение или
                серверное оборудование Приложения может хранить ключи доступа (токены), используемые для авторизации на этих
                сайтах или сервисах.</p>
            <p>5.3. Разработчик защищает всю полученную в процессе использования Пользователем Приложения персональную
                информацию.</p>
            <p>5.4. Использование персональной информации Пользователя регулируется законодательством о защите персональной
                информации.</p>
            <p>5.5. Разработчик принимает необходимые и достаточные организационные и технические меры для защиты
                персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения,
                блокирования, копирования, распространения, а также от иных неправомерных действий с ней третьих лиц.</p>
            <p>5.6. Исходный код, дизайн, и структура Приложения распространяются по лицензии GPLv3, а серверная часть
                программного кода - по лицензии AGPLv3, в рамках которых пользователь имеет право:</p>
            <p>5.6.1. Запускать и использовать Приложение как угодно, для любой цели</p>
            <p>5.6.2. Изучать программный код Приложения, а также модифицировать его в своих целях</p>
            <p>5.6.3. Распространять копии Приложения</p>
            <p>5.6.4. Распространять модифицированные копии Приложения - с тем, чтобы принести пользу всему сообществу</p>
            <p>5.7. Информация, которую получает Пользователь о Разработчике в ходе установки и использования Приложения,
                является конфиденциальной информацией. Пользователь не вправе распространять данную информацию без
                письменного согласия Разработчика.</p>
            <p>5.8. Разработчик оставляет за собой право собирать информацию об ошибках в работе Приложения без или с
                уведомлением Пользователя.</p>


            <p>6. Заключительные положения</p>

            <p>6.1. Пользователь гарантирует, что все условия Соглашения ему понятны, и он принимает их безусловно и в
                полном объеме.</p>
            <p>6.2. Все заявления Пользователей, касательно Приложения, Разработчик принимает на почтовый адрес
                'mail@plashiki.su'.</p>
            <p>6.3. Разработчик обязуется предоставлять ответы на заявления Пользователя в течение 6 (шести) месяцев с
                момента получения данного заявления.</p>
            <p>6.4. Все споры, которые возникают в связи с исполнением данного Соглашения, включая любые вопросы касательно
                его существования, законности, трактования, применения или прекращения, должны быть первоочередно решены
                мирным путем переговоров.</p>
            <p>6.5. В случае если споры не будут разрешены путем переговоров, споры подлежат разрешению в порядке,
                установленном действующим законодательством той страны, в которой находится Разработчик.</p>
            <p>6.6. Настоящее Соглашение составлено на русском языке и может быть предоставлено Пользователю для
                ознакомления на другом языке. В случае расхождения русскоязычной версии оглашения и версии Соглашения на
                ином языке, применяются положения русскоязычной версии настоящего Соглашения.</p>
            <p>6.7. Если, по тем или иным причинам, одно или несколько положений настоящего Соглашения будут признаны
                недействительными, или не имеющими юридической силы, это не оказывает влияния на действительность или
                применимость остальных положений.</p>

            Разработчик:
            PlaShiki Dev Team / mail@plashiki.su
        </v-simple-card>
    </div>
</template>

<script lang="ts">
import { Component, Vue } from 'vue-property-decorator'
import { appStore } from '@/store'
import VSimpleCard from '@/components/common/VSimpleCard.vue'

@Component({
    components: { VSimpleCard }
})
export default class TosPage extends Vue {
    mounted (): void {
        appStore.merge({
            pageTitle: this.$t('Pages.Tos.Name')
        })
    }
}
</script>

<style>

</style>
